# SetStaticTextColorN

## Description
```pascal
PROCEDURE SetStaticTextColorN(
				dialogID    : LONGINT;
				componentID : LONGINT;
				tint        : INTEGER);
```

```python

def vs.SetStaticTextColorN(dialogID, componentID, tint):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|tint|INTEGER|Tint number. See Appendix for the available values.|

## Version
Availability: from Vectorworks 2023
## Category
* Dialogs - Modern